In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("P1_Exe.csv")

In [3]:
df.head(3)

    Name  Age  Marks
0   Amit   20     85
1   Neha   19     90
2  Rahul   21     78

In [4]:
df.tail(2)

    Name  Age  Marks
3  Pooja   20     88
4  Krish   22     92

In [5]:
df.shape

(5, 3)

In [6]:
df.shape[0]

5

In [7]:
df.shape[1]

3

In [11]:
df.rename(columns={"Name":"Student"},inplace=True)
print(df)

  Student  Age  Marks
0    Amit   20     85
1    Neha   19     90
2   Rahul   21     78
3   Pooja   20     88
4   Krish   22     92